Tekla Open API Reference for Tekla Structures 2025
Parallel.PlaneToPlane Method
Overload List
Name | Description
PlaneToPlane(GeometricPlane, GeometricPlane)
 Returns true if the given planes are parallel.
PlaneToPlane(GeometricPlane, GeometricPlane, Double)
 Returns true if the given planes are parallel within the given angular tolerance.
Top
See Also
Reference
Parallel Class
Tekla.Structures.Geometry3d Namespace